versão-backend/app/controllers/municipies_controller.rb

INSERT INTO "municipes" ("full_name", "cpf", "cns", "email", "birth_date", "phone_number", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    municipe = Municipe.new(municipe_attributes)

    if municipe.save

UPDATE "municipes" SET "cpf" = ?, "cns" = ?, "email" = ?, "phone_number" = ?, "updated_at" = ? WHERE "municipes"."id" = ?  [["cpf", "MyString12"], ["cns", "MyString12"], ["email", "MyString12@email.com"], ["phone_number", "MyString12"], ["updated_at", "2023-03-18 21:19:59.949523"], ["id", 1]]
---
  def update
    if @municipe.update(municipe_attributes)

SELECT "municipes".* FROM "municipes" WHERE "municipes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def set_municipe
    @municipe = Municipe.find(params[:id])